{ "domains": [ { "title": "Cognition", "archetypes": [ { "title": "The Visionary", "desc": "Big-picture thinker, future-oriented, idealistic, creative. Gift: Inspiration. Shadow: Unrealistic, ungrounded. Practice: Ground your visions with practical steps." }, { "title": "The Analyst", "desc": "Logical, detail-oriented, critical, strategic. Gift: Problem-solving. Shadow: Overthinking, rigid. Practice: Balance analysis with intuition." }, { "title": "The Synthesizer", "desc": "Integrative, sees connections, holistic, adaptive. Gift: Innovation. Shadow: Scattered focus. Practice: Clarify priorities before acting." } ] }, { "title": "Emotion", "archetypes": [ { "title": "The Empath", "desc": "Sensitive, compassionate, attuned to feelings. Gift: Caring. Shadow: Overwhelm, lack of boundaries. Practice: Self-care and boundary setting." }, { "title": "The Stoic", "desc": "Resilient, composed, calm in crisis. Gift: Stability. Shadow: Emotional suppression. Practice: Allow and express emotion safely." }, { "title": "The Inspirer", "desc": "Uplifting, motivating, emotionally expressive. Gift: Joy. Shadow: Inconsistency, emotional volatility. Practice: Anchor inspiration in daily rituals." } ] }, { "title": "Behavior", "archetypes": [ { "title": "The Creator", "desc": "Action-oriented, productive, innovative, builder. Gift: Manifestation. Shadow: Burnout, workaholism. Practice: Rest and celebrate progress." }, { "title": "The Helper", "desc": "Service-driven, generous, reliable. Gift: Support. Shadow: Overgiving, martyrdom. Practice: Balance service with self-honoring." }, { "title": "The Explorer", "desc": "Adventurous, curious, open-minded. Gift: Growth. Shadow: Restlessness, lack of roots. Practice: Integrate newness with stability." } ] }, { "title": "Spirit", "archetypes": [ { "title": "The Sage", "desc": "Seeker of wisdom, intuitive, spiritual. Gift: Insight. Shadow: Isolation, spiritual bypass. Practice: Embody wisdom in daily life." }, { "title": "The Mystic", "desc": "Deeply intuitive, attuned to mystery, transformative. Gift: Depth. Shadow: Escapism, confusion. Practice: Channel mystery into creative expression." }, { "title": "The Guide", "desc": "Mentor, teacher, healer. Gift: Illumination. Shadow: Ego, attachment to being needed. Practice: Empower others, release attachment." } ] } ], "report_templates": [ { "heading": "How to Read Your SoulMind Blueprint", "body": "This report reveals your dominant cognitive, emotional, behavioral, and spiritual patterns as archetypes. Each archetype holds gifts and shadow lessons, with practices to cultivate balance. Use this as a mirror, not a verdict." }, { "heading": "Cognition Domain", "body": "Your mental lens and processing style." }, { "heading": "Emotion Domain", "body": "Your emotional patterns and responses." }, { "heading": "Behavior Domain", "body": "How you act and show up in the world." }, { "heading": "Spirit Domain", "body": "Your spiritual orientation and growth path." } ] }